app/controllers/route_controller.rb

SELECT "routes".* FROM "routes" WHERE "routes"."user_id" = ?  [["user_id", 1]]
---
	def get_user_routes
		set_access_control
		if is_logged_user!
			if (result = Route.where(:user_id => current_user.id))