app/controllers/stage_controller.rb

	def get_stage_by_route
		set_access_control
		if is_logged_user!
			if (params[:route_id])
				route_id = params[:route_id].to_i
				if (result = Stage.where(:route_id => route_id))
---
SELECT "stages".* FROM "stages" WHERE "stages"."route_id" = ?  [["route_id", 1]]