app/controllers/users_controller.rb

  def user_check
  	set_access_control
  	if is_logged_user!
      if result = User.where(:id => current_user.id).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]